#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-qm2qEbrdsWgdM8YL

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Initializing plugins and modules...
random_password.db_password: Refreshing state... [id=none]
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_resource.app: Refreshing state... [id=l8dcc6]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_api_gateway_resource.api: Refreshing state... [id=9jt82m]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cmapde]
aws_api_gateway_resource.api_proxy: Refreshing state... [id=uysksd]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-gcp9dahm4c-cmapde-ANY]
aws_api_gateway_method.api_proxy: Refreshing state... [id=agm-gcp9dahm4c-uysksd-ANY]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-keycloak,private]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210817012201712900000001]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_function.css_api: Refreshing state... [id=lambda-css-api]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-cmapde-ANY]
aws_lambda_permission.apigw_api: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.api: Refreshing state... [id=agi-gcp9dahm4c-uysksd-ANY]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=bsp54p]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_api_gateway_integration.api has been changed
  ~ resource "aws_api_gateway_integration" "api" {
      + cache_key_parameters    = []
        id                      = "agi-gcp9dahm4c-uysksd-ANY"
      + request_parameters      = {}
      + request_templates       = {}
        # (10 unchanged attributes hidden)
    }
  # aws_lambda_function.css_api has been changed
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2022-08-18T21:10:38.578+0000" -> "2022-08-18T21:11:07.488+0000"
      + layers                         = []
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # aws_api_gateway_method.api_proxy has been changed
  ~ resource "aws_api_gateway_method" "api_proxy" {
      + authorization_scopes = []
        id                   = "agm-gcp9dahm4c-uysksd-ANY"
      + request_models       = {}
      + request_parameters   = {}
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-08-18T21:11:14.709Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "api-dev.loginproxy.gov.bc.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "api-dev.loginproxy.gov.bc.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "api-dev.loginproxy.gov.bc.ca",
        ]
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_apigatewayv2_api_mapping.this will be created
  + resource "aws_apigatewayv2_api_mapping" "this" {
      + api_id      = "gcp9dahm4c"
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage       = "test"
    }

  # aws_apigatewayv2_domain_name.this will be created
  + resource "aws_apigatewayv2_domain_name" "this" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "api-dev.loginproxy.gov.bc.ca"
      + id                               = (known after apply)
      + tags_all                         = (known after apply)

      + domain_name_configuration {
          + certificate_arn                        = (known after apply)
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-08-18T21:11:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "eB6uRZaLxYm6GP386MzVni/HtIDH1g0IV8P3vcFVkfE=" -> "rUAQGVWq68ox3Hpuw9myqlGmyAnPfkJ2vUAbTQfBsgw="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-08-18T21:11:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "v1uS53Vk+faOQgYLBkxTp6CXANwri0WppVGJFEgFouo=" -> "sAZqU8THiU+rXg0Q2MGWuJNhVxgnv4ZLmdZx7DU4zK0="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be updated in-place
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2022-08-18T21:11:07.488+0000" -> (known after apply)
      ~ source_code_hash               = "GZX3R5P1yPFwuofKhVWEvh6KD8o/58UMAOAV5dX0BT0=" -> "QBaGR62kPNFPOqTaRPWPax1yyPOGE7Pzezw08NcgqsM="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-08-18T21:11:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "reG2yfT9FU66uJAqyVaSANHtq4Bq6Eyv3s3IpU9K5U4=" -> "A+QCGNo+sgROX3DhpdbrEIVomqdRtkKMW5VjL1Yt9tM="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-08-18T21:10:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "dxBahP+GGY50OrxmntkYzGjYllG8CrzyT21NB/QTZ1I=" -> "5p6S3/P0r8W/nCvCma4THTQdpvmAmk70c6SmJADwF5Y="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-08-18T21:11:14.709Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 8 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*